---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveElemDefinesSlope
source: html/ce4dfdc7-54f7-a694-e897-4261f0511d8e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveElemDefinesSlope Property

"Defines Beam System Slope"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveElemDefinesSlope { get; }
```